Revit 2022 API
AnalyticalConsistencyChecking Class
 Utilities that allow for detection of incorrect or incomplete analytical consistency.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public static class AnalyticalConsistencyChecking
Visual Basic
Public NotInheritable Class AnalyticalConsistencyChecking
Visual C++
public ref class AnalyticalConsistencyChecking abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.AnalyticalConsistencyChecking
See Also
AnalyticalConsistencyChecking Members
Autodesk.Revit.DB.Structure Namespace